[
  {
    "name": "NatureVista Haven",
    "county": "Greenwood County",
    "description": "Immerse yourself in a green oasis with this eco-conscious residence, featuring smart gardening, water purification, and energy-harvesting pathways.",
    "features": [
      {
        "name": "Intelligent Garden Oasis",
        "description": "Automated irrigation based on plant needs, creating a lush and thriving outdoor space."
      },
      {
        "name": "Butterfly Meadows",
        "description": "Dedicated garden sections designed to attract and nurture butterflies, adding a touch of nature to your backyard."
      },
      {
        "name": "Air-Purifying Sanctuary",
        "description": "Indoor plants strategically placed for air purification, ensuring a fresh and healthy living environment."
      }
    ],
    "estimated_price": "$550,000"
  },
  {
    "name": "AquaHarbor Retreat",
    "county": "Marine County",
    "description": "Experience water purity at its finest with this residence featuring state-of-the-art water purification systems and serene aquatic landscapes.",
    "features": [
      {
        "name": "Bio-Cleansing Technology",
        "description": "Utilizes bio-engineered filters to cleanse water from harmful pathogens, providing crystal-clear water for various household uses."
      },
      {
        "name": "Tranquil Floating Gardens",
        "description": "A beautifully designed pond with floating gardens that not only enhance aesthetics but also naturally filter and purify the water."
      },
      {
        "name": "On-the-Go Purification",
        "description": "Compact and portable water purification units, perfect for outdoor adventures or emergencies."
      }
    ],
    "estimated_price": "$720,000"
  },
  {
    "name": "EcoEnergia Estate",
    "county": "Sustainable County",
    "description": "Live in harmony with nature with this residence featuring energy-harvesting pathways, adaptive lighting, and interactive outdoor elements.",
    "features": [
      {
        "name": "Pathway Power Stations",
        "description": "Stores energy generated from footsteps during the day, providing sustainable illumination for pathways and nearby areas at night."
      },
      {
        "name": "Smart Illumination System",
        "description": "Lights that automatically adjust based on natural light and movement, optimizing energy consumption while keeping your surroundings well-lit."
      },
      {
        "name": "Interactive Outdoor Experience",
        "description": "Engage with your outdoor space through interactive ground projections, turning your garden into a dynamic and entertaining environment."
      }
    ],
    "estimated_price": "$650,000"
  },
  {
    "name": "GreenLiving Retreat",
    "county": "Eco Valley",
    "description": "Embrace a sustainable lifestyle with this residence, complemented by a digital platform offering educational courses on eco-friendly practices.",
    "features": [
      {
        "name": "Hands-On Green Workshops",
        "description": "Participate in DIY sessions covering everything from waste upcycling to creating and maintaining your own eco-friendly garden."
      },
      {
        "name": "Nature Education for All Ages",
        "description": "Tailored courses for residents and children, promoting awareness of nature conservation, renewable energy, and biodiversity."
      },
      {
        "name": "Green Living Webinars",
        "description": "Join online sessions with experts in sustainable living, green architecture, and eco-technology, fostering a community of like-minded residents."
      }
    ],
    "estimated_price": "$590,000"
  }
]
